Repository: zabbix-jp/translation
Catalog: releasenote/releasenote-omegat.tmx
Source language: en_us
Languages: ja

source: [ZBX-3825] fixed errors with single quotes in javascript messages
ja: [ZBX-3825] JavaScriptメッセージ内のシングルクォートによるエラーを修正

source: Find it in directory doc/ of ZABBIX source distribution.
ja: ZABBIXのソースファイルのdocディレクトリに保存されています。

source: Added support of system.swap.size and net.tcp.listen under FreeBSD, system.boottime under Solaris, system.cpu.load under Solaris 2.6, vm.memory.size under AIX 6.x.
ja: FreeBSD上のsystem.swap.size、net.tcp.listen、Solaris上のsystem.boottime、Solaris 2.6上のsystem.cpu.load、AIX 6.x上のvm.memory.sizeが利用できるようになりました。

source: ZABBIX Proxy is a lightweight process, which collects data on behalf of ZABBIX Server.
ja: ZABBIXプロキシは、ZABBIXサーバに変わってデータを収集する軽量なプロセスです。

source: [ZBX-12] fixed calculations in ZABBIX availability report
ja: [ZBX-12] 稼働レポート計算処理を修正

source: [ZBX-1357] updated German translation; thanks to Peter Schultz
ja: [ZBX-1357] ドイツ語訳を更新; Peter Schultzに感謝

source: ZABBIX Agent supports data buffering, which can be tuned by new configuration parameters, BufferSize and BufferSend.
ja: ZABBIXエージェントでデータのバッファリング機能を利用することができます。この機能は新しい設定パラメータBufferSizeとBufferSendで調整することができます。

source: Complete list of Bugs and Improvements included into 1.8.5
ja: 1.8.5に含まれるすべてのバグフィックスと改善の一覧

source: [ZBX-4015] fixed multiple XSS issues
ja: [ZBX-4015] いくつかののXSS問題を修正

source: ZABBIX Server can bind to one network interface only.
ja: zabbix_server.confの新しいパラメータListenIPを利用することにより、ZABBIX Serverを指定されたネットワークインターフェースのみバインドさせることができます。

source: added support of applications in action conditions
ja: アクションのコンディションにアプリケーションの機能を追加

source: The database is down message is supported for all DB engines
ja: データベースダウンメッセージがすべてのDBエンジンに対応

source: fixed filter in audit filtering only logs
ja: 監査ログのフィルタを修正

source: [ZBX-283] fixed SQL statement where INTEGER exceeds allowed range
ja: [ZBX-283] 許可された範囲を超えた整数が含まれるSQL文を修正

source: Thanks to Olexiy Zagorskiy.
ja: Olexiy Zagorskiyに感謝

source: [ZBX-652] improved support of SNMP items
ja: [ZBX-652] SNMPアイテムの改善

source: [ZBX-3911] fixed wrong trigger expression parsing when key parameters contained "("
ja: [ZBX-3911] キーパラメータに"("が含まれる場合の誤ったトリガー式の構文解析を修正

source: This document contains the release notes for ZABBIX 1.6.7.
ja: このドキュメントはZABBIX 1.6.7のリリースノートを含みます。

source: A host may have unlimited number of linked templates.
ja: ホストは無制限にテンプレートのリンクを保持することができます。

source: It has been tested on a very limited number of systems.
ja: 非常に限られた数のシステムでしかテストを行っていないため

source: Zabbix SIA is proud to announce the availability of Zabbix 1.8.3rc3 (Third Release Candidate).
ja: Zabbix SIAはZABBIX 1.8.3rc3 (3番目のRelease Candidate)のリリースをアナウンスすることを光栄に思います。

source: Added automatic selection first group and host in WEB monitoring
ja: Webモニタリングに最初のグループとホストの自動選択機能を追加

source: [ZBX-3889] fixed deadlocks while processing triggers
ja: [ZBX-3889] トリガーの処理中にデッドロックが発生する問題を修正

source: [ZBX-1357,ZBX-3462] updated Japanese translation; thanks to Kodai Terashima
ja: [ZBX-1357,ZBX-3462] 日本語翻訳を更新; Kodai Terashimaに感謝

source: [ZBX-2011] plain ASCII subjects are no longer base64-encoded, fixes issues with email to SMS gateways
ja: [ZBX-2011] プレーンASCIIの件名はbase64でエンコードしないようにし、SMSゲートウェイ宛のEメールについての問題を修正

source: [ZBX-1589] fixed no permission error when try to edit host form from search screen
ja: [ZBX-1589] 検索画面からホストの編集をしようとした際の権限無しエラーを修正

source: [ZBX-4249] fixed trigger wizard "insert macro" action break expression
ja: [ZBX-4249] トリガーウィザードの「マクロの挿入」で式が壊れる問題を修正

source: The macros will greatly simplify maintenance of large Zabbix setup with host specific configuration parameters.
ja: マクロは大規模なシステムを監視する際にホスト固有の設定パラメータの管理を非常に簡単にすることができます。

source: New communication protocol
ja: 新しい通信プロトコル

source: [ZBX-3273] removed renewed auto registration notifications for already created hosts
ja: [ZBX-3273] 既に作成済のホストの自動登録の通知を削除

source: [ZBX-646] audit log entries added for screen edit actions
ja: [ZBX-646] スクリーン編集操作を監査ログに追加

source: [ZBX-3391] fixed wrong comparison operators used for strings
ja: [ZBX-3391] 文字列に対して誤った比較演算子を利用していた問題を修正

source: [ZBX-2890] fixed parsing of negative values in trigger expressions
ja: [ZBX-2890] トリガー条件式の負の値の構文解析を修正

source: [ZBX-886] removed duplicate locale string S_ACTIONS_BIG
ja: [ZBX-886] 重複していた翻訳文字列「S_ACTIONS_BIG」を削除

source: [ZBX-2146] fixed error when try to view slideshow without slides
ja: [ZBX-2146] スライドが存在しない時にスライドショーを表示しようとすると発生するエラーを修正

source: Database down screen
ja: データベースダウン画面

source: We would like to thank our partners, customers and community members for their continuous support and efforts in aiding ZABBIX to become more and more mature and intelligent product.
ja: 私たちはZABBIXがより良いプロダクトになるために継続的なサポートと努力を行ってくれているパートナー、顧客、コミュニティメンバーに感謝します。

source: [ZBX-189, CVE-2007-6210] fixed super-user permissions of user commands
ja: [ZBX-189, CVE-2007-6210] ユーザコマンドのスーパーユーザ権限を修正

source: [ZBX-1356] fixed undefined errors on user group deletion
ja: [ZBX-1356] ユーザグループ消去時の未定義エラーを修正

source: added support of NOT IN operator for time periods
ja: 期間設定に「期間外」演算子を追加

source: [ZBX-588] fixed undefined variable in trigger status page
ja: [ZBX-588] トリガーステータス画面の定義されていない変数を修正

source: [ZBX-1643] removed edit links from search if no write access to object
ja: [ZBX-1643] 対象に書き込み件がない場合に、検索結果から変更のリンクの削除

source: [DEV-261] added triggers status to screens
ja: [DEV-261] スクリーンにトリガーステータスを追加

source: This document contains the release notes for ZABBIX 1.6.6.
ja: このドキュメントはZABBIX 1.6.6のリリースノートを含みます。

source: [ZBX-2551] fixed not shown errors in configuration/triggers
ja: [ZBX-2551] 設定/トリガーの画面にエラーメッセージが表示されない問題を修正

source: [DEV-459] made improvements in discovery page generation
ja: [DEV-459] ディスカバリページの生成を改善

source: [ZBX-1877] template itself in template linkage popup is now disabled
ja: [ZBX-1877] テンプレートリンクのポップアップ画面で自身のテンプレートを選択できないように修正

source: [ZBX-2407] fixed repeated message on cookie size limit
ja: [ZBX-2407] クッキーサイズの制限でメッセージが繰り返される問題を修正

source: [ZBX-1334] improved performance of template edit form
ja: [ZBX-1334] テンプレート編集フォームのパフォーマンスを改善

source: [ZBX-3626] fixed bugs on map export: duplicate image decoding and duplicate map elements insertation; thanks to Takanori Suzuki
ja: [ZBX-3626] マップのエクスポート時に画像のデコードやアイコンが重複する問題を修正; Takanori Suzukiに感謝

source: ZABBIX Proxy Process
ja: ZABBIXプロキシプロセス

source: [DEV-358] added notification macros {NODE.*[1..9]}
ja: [DEV-358] 通知用マクロ{NODE.*[1..9]}を追加

source: [ZBX-1181] fixed download speed, response time, and response code not being saved for failed Web scenario steps
ja: [ZBX-1181] Webシナリオのステップが失敗した場合にダウンロードスピード、レスポンスタイム、レスポンスのコードが保存されない問題を修正

source: details box is open by default if any error occured
ja: エラーが発生した際にデフォルトで詳細ボックスが開くように変更

source: [ZBX-888] more supported GSM modems (ignoring AT+CMEE command)
ja: [ZBX-888] GSMモデムのサポート強化(AT+CMEEコマンドの無視)

source: This document contains the release notes for ZABBIX 1.6.9.
ja: このドキュメントはZABBIX 1.6.9のリリースノートです。

source: [ZBX-3435] fixed error that sometimes appear after profile edit
ja: [ZBX-3435] プロファイル変更後に時々発生していたエラーを修正

source: [ZBX-894] fixed processing of {HOSTNAME} for trigger name if the trigger expression consists of several items
ja: [ZBX-894] トリガー条件式にいくつかのアイテムを使用した場合のトリガー名の{HOSTNAME}の処理を修正

source: [ZBX-3215] fixed filtering by group in trigger selection popup
ja: [ZBX-3215] トリガー選択ポップアップのグループによるフィルタリングを修正

source: 7 September 2011
ja: 2011年9月7日

source: [ZBX-1954] fixed config file errors if special chars are used in db password
ja: [ZBX-1954] dbパスワードに特殊文字が使用されていた場合に設定ファイルがエラーになる問題を修正

source: Now it is also possible to use auto-aligning for icon placement.
ja: また、アイコンのを自動的に整列できるようになりました。

source: [ZBX-2616] bundled DejaVu font upgraded from 2.32 to 2.33
ja: [ZBX-2616] バンドルしているDejaVuフォントを2.32から2.33に更新

source: The following functionality is introduced in this release and will be available in stable ZABBIX 1.6.
ja: 以下の機能はこのリリースで追加され、安定版であるZABBIX 1.6で利用することができるようになります。

source: [ZBX-991] fixed processing of zabbix[queue] internal check
ja: [ZBX-991] 内部チェックzabbix[queue]の処理を修正

source: Installation and Upgrade Notes
ja: インストールとアップグレード方法

source: Nanosecond resolution for historical data
ja: ヒストリデータにナノ秒を使用

source: [ZBX-809] fixed memory leak while processing perf_counter metric under Windows
ja: [ZBX-809] Windowsのperf_counterの処理中にメモリリークが発生する問題を修正

source: [ZBX-1962] explicit 'not monitored' response for active agents on disabled hosts
ja: [ZBX-1962] 無効の状態のホストのアクティブエージェントは明示的に「未監視」を返すように修正

source: [ZBX-1974] removed "Dropdown first entry" "1.6.2 comp mode" option
ja: [ZBX-1974] 「ドロップダウンの最初の項目」オプションから「1.6.2互換モード」を削除

source: [ZBX-3682] fixed import of map elements having empty label; thanks to Takanori Suzuki
ja: [ZBX-3682] 空のラベルを持つマップ要素のインポートを修正; Takanori Suzukiに感謝

source: [ZBX-3460] forbid saving host with enabled IPMI but without IPMI address
ja: [ZBX-3460] IPMIが有効にも関わらずIPMIアドレスが設定されていないホストの保存を禁止

source: [ZBX-1294] disabled GUI interface action elements for editing a templated trigger
ja: [ZBX-1294] Webインターフェースでテンプレートから継承されたトリガーを変更できないように修正

source: [ZBX-1347] added support of hostnames and keys with spaces in sender input file
ja: [ZBX-1347] senderの入力ファイルにスペースが含まれるホスト名とキーを利用できるように修正

source: [ZBX-2356] fixed error while performing group actions when creating an item
ja: [ZBX-2356] アイテム作成時のグループのアクション実行中に発生するエラーを修正

source: [ZBX-650] DM: fixed memory leak in synchronization of node configuration
ja: [ZBX-650] 分散モニタリング: ノード間の設定の同期のメモリリークの問題を修正

source: Different trigger conditions can be defined depending on trigger value.
ja: 異なるトリガーの状態をトリガーの値に依存させることができます。

source: [ZBX-3483] added missing fields in items mass update
ja: [ZBX-3483] アイテムの一括更新で欠けていたフィールドを追加

source: [ZBX-348] fixed incorrect processing of large integer values for {ITEM.LASTVALUE}
ja: [ZBX-348] {ITEM.LASTVALUE}に大きい整数値を利用した場合の間違った処理を修正

source: Use it and make your triggers and logic much smarter!
ja: この機能を利用することでトリガーとロジックをよりUse スマートにすることができます。

source: This document contains the release notes for ZABBIX 1.6.8.
ja: このドキュメントはZABBIX 1.6.8のリリースノートを含みます。

source: [ZBX-4232] fixed unclear log messages when checks are temporarily enabled/disabled
ja: [ZBX-4232] 監視が一時的に有効/無効なった場合の分かりにくいログを修正

source: [ZBX-1879] fixed unnecessary line breaks in IE7
ja: [ZBX-1879] IE7使用時に不要な改行が含まれる問題を修正

source: [ZBX-1907] changed logging - when a proxy fails to connect to the server it logs "Still unable to connect" message max once a minute
ja: [ZBX-1907] プロキシサーバがZabbixサーバに接続できなかった時、"Still unable to connect"というメッセージを最大1分間に1回出力するようログ出力を変更

source: [ZBX-2100] fixed group with templates but without hosts breaks map editing issue
ja: [ZBX-2100] ホストの無いグループにテンプレートを使用するとマップ編集ができなくなる問題を修正

source: Pie charts (both 2D and 3D) are supported.
ja: 円グラフ(2Dと3D)を利用することができます。

source: On-demand reload of configuration cache
ja: 要求に応じた設定情報のキャッシュの再読み込み

source: Global search function
ja: グローバル検索機能

source: [ZBX-2446] fixed compilation on AIX 5.3 with OS level 5300-05 or earlier
ja: [ZBX-2446] OSレベルが5300-05以下のAIX 5.3上でコンパイルできない問題を修正

source: [ZBX-2232] fixed bug with last event duration time in event details
ja: [ZBX-2232] イベントの詳細画面の最新のイベントの継続時間に関するバグを修正

source: [ZBX-1922] fixed compilation of Zabbix agent under ac AIX 5.1/5.2
ja: [ZBX-1922] AIX 5.1/5.2上のZabbixエージェントのコンパイルエラーを修正

source: [ZBX-1510] fixed history view bound by minute issue
ja: [ZBX-1510] 分単位に制限されていたヒストリ画面の問題を修正

source: [ZBX-1653] fixed link from maps to events
ja: [ZBX-1653] マップからイベントへのリンクを修正

source: [ZBX-3544] fixed user login method reseting attempts
ja: [ZBX-3544] ユーザログインメソッドのリセット試行を修正

source: [ZBX-3144] removed parsing of existing expression in trigger expression popup
ja: [ZBX-3144] トリガー条件式ポップアップの既存の条件式の解析を削除

source: [ZBX-1593] fixed errors when admin tries to add hostgroup editin host
ja: [ZBX-1593] 管理者がホスト編集時にホストグループを追加しようとした際のエラーを修正

source: [DEV-423] added filtering of the Windows Event Log by Type, Source and Event ID on the agent side
ja: [DEV-423] エージェント側でタイプ、ソース、イベントIDによるWindowsイベントログのフィルタリングを追加

source: [ZBX-521] fixed problem in FreeBSD with threads in proc.num and proc.mem items
ja: [ZBX-521] proc.num、proc.memアイテムのFreeBSDのスレッドに関する問題を修正

source: Queue now displays numbers differently
ja: 現在のキューの数を異なる表示方法で表示

source: [ZBX-2875] updated Japanese translation; thanks to Kodai Terashima
ja: [ZBX-2492] 日本語翻訳を更新; Kodai Terashimaに感謝

source: Recompile Zabbix binaries and update front-end PHP files, executed database patch.
ja: Zabbixバイナリのリコンパイル、フロントエンドPHPファイルのアップデート、データベースのパッチ適用が必要です。

source: [DEV-262] added group filtering for "Trigger info"
ja: [DEV-262] 「トリガー情報」にグループフィルタリングを追加

source: [DEV-266] added support of octal and hexadecimal data
ja: [DEV-266] 8進数と16進数のデータのサポートを追加

source: [ZBXNEXT-799] added support of SRV records to net.tcp.dns.query[]; thanks to Edward Rudd
ja: [ZBXNEXT-799] net.tcp.dns.query[]にSRVレコードのサポートを追加; Edward Ruddに感謝

source: ZABBIX Proxy significantly simplifies deployment and maintenances of large ZABBIX setups in a distributed environment.
ja: ZABBIXプロキシは分散環境において、複雑なZABBIX設定の配置とメンテナンスを非常にシンプルにします。

source: [ZBX-538] fixed wrong theme pick up in login screen issue
ja: [ZBX-538] ログイン画面の誤ったテーマ選択の問題を修正

source: fixed processing of long data by zabbix_get
ja: zabbix_getの長いデータの処理を修正

source: One set of conditions can generate multiple actions (remote commands, user notifications).
ja: ひとつのコンディションから複数のアクション(リモートコマンドとユーザー通知など)を実行することができます。

source: ZABBIX distributed setup supports up-to 1000 nodes which all can be configured either locally or from a central location.
ja: ZABBIXの分散セットアップは1000ノード以上の監視をサポートし、ローカルまたは中央管理のどちらからの設定も可能にします。

source: increased default max number of log file lines sent per second to 100
ja: 1秒間あたりに送付できるログファイルの最大行数のデフォルト値を100行に増加

source: improved queries in "Graphs" page
ja: グラフ画面のクエリを改善

source: [ZBX-2155] ipv6 addresses are now case insensitive
ja: [ZBX-2155] ipv6アドレスで大文字小文字を区別しないよう修正

source: added support of perf_counter[path<,period>]
ja: perf_counter[path<,period>]を追加

source: [ZBX-3256] added automatic detection of fping command line option to use for specifying source IP address
ja: [ZBX-3256] 任意の送信元IPアドレスを設定するためのfpingコマンドラインオプションの自動検出機能を追加

source: [ZBX-965] fixed color in graph legend
ja: [ZBX-965] グラフの凡例の色を修正

source: Search results became more readable and easy to use.
ja: 検索結果もより読みやすく、使いやすくなりました。

source: Zabbix API provides easy and very efficient way of remote management and integration with 3rd party tools and services.
ja: Zabbix APIにより、サードパーティのツールやサービスによるリモートからの管理と統合化を簡単かつ効果的に行うことができます。

source: [ZBX-1873] added slideshow delay multiplier and fixed slides not showing graphs
ja: [ZBX-1873] 複数の間隔のスライドショーを追加し、スライドでグラフが表示できない問題を修正

source: [ZBX-4104] fixed handle handling when executing scripts in Windows
ja: [ZBX-4104] Windows上でのスクリプト実行時の処理を修正

source: [ZBX-2642] fixed items multiplier field
ja: [ZBX-2642] アイテムの乗数のフィールドを修正

source: A nice overview of the new functionality is at http://www.zabbix.com/documentation/1.8/manual/about/what_s_new_1.8.9.
ja: 新機能の概要はhttp://www.zabbix.com/documentation/1.8/manual/about/what_s_new_1.8.9から参照することができます。

source: [ZBX-2489] fixed server crash when receiving data using the old protocol
ja: [ZBX-2489] 旧プロトコルを使用してデータを受信した場合にサーバがクラッシュする問題を修正

source: [ZBX-1647] removed displaying of host availability on maps
ja: [ZBX-1647] マップにおけるホストのエージェントの状態の表示を削除

source: [ZBX-3498] removed the 'Status' column from the 'Add simple graph' pop-up
ja: [ZBX-3498] 「追加 シンプルグラフ」のポップアップから「ステータス」のカラムを削除

source: Zabbix SIA is proud to announce the availability of Zabbix 1.9.6 (First Beta Release of Zabbix 2.0).
ja: Zabbix SIAはZabbix 1.9.6 (Zabbix 2.0の最初のベータリリース)のリリースをアナウンスすることを光栄に思います。

source: [ZBX-2931] fixed dns and ip fields, item statuses and trigger values for default templates
ja: [ZBX-2931] デフォルトテンプレートのDNSとIPの項目、アイテムのステータス、トリガーのステータスを修正

source: [ZBX-4194] fixed SQL query errors in distributed environment with three digit node numbers
ja: [ZBX-4194] 3桁のノード番号を利用した分散監視環境のSQLエラーを修正

source: [ZBXNEXT-538] include ibm_db2.sql and images_ibm_db2.sql files in distribution package
ja: [ZBXNEXT-538] 配布パッケージにibm_db2.sqlとimages_ibm_db2.sqlを含むように修正

source: fixed links drawing type of map
ja: マップのリンクの線種を修正

source: Pie Charts
ja: 円グラフ

source: [ZBX-2474,ZBXNEXT-378] fixed page refresh on filter change, now all filters hiding and showing works without refresh
ja: [ZBX-2474,ZBXNEXT-378] フィルタ変更時のページの更新処理を修正し、更新なしで全フィルタの表示/非表示の切替ができるように変更

source: [ZBX-3802] fixed error when try to open custom screen from history link
ja: [ZBX-3802] 履歴のリンクからカスタムスクリーンを開いた時のエラーを修正

source: [ZBXNEXT-119] added support for time shifted functions
ja: [ZBXNEXT-119] タイムシフト機能を追加

source: [ZBX-938] fixed usage of 'color' in en_gb locale
ja: [ZBX-938] en_gbロケールの'color'の利用に関する修正

source: Support of escalations and repeated notifications has been implemented.
ja: エスカレーションと繰り返し通知の機能が実装されました。

source: Improved event viewing
ja: イベントの表示を改善

source: Zabbix SIA is proud to announce the availability of Zabbix 1.8.1.
ja: Zabbix SIAはZabbix 1.8.1のリリースをアナウンスすることを光栄に思います。

source: [ZBX-2305] fixed actions getting lost in an event-busy environment
ja: [ZBX-2305] イベントが大量に発生する環境でアクションが欠落する問題を修正

source: New XML data import and export functionality is an excellent way of sharing templates, hosts configuration and items/triggers related information.
ja: XMLデータによる新しいインポート/エクスポート機能は、ホスト設定やアイテム/トリガーに関係する情報であるテンプレートを共有するための優れた方法です。

source: Very flexible timing can be defined for each maintenance period.
ja: それぞれのメンテナンス期間ごとに非常に柔軟性高くメンテナンスタイミングを設定することができます。

source: [ZBX-361] fixed possible "division by zero" in Monitoring/Triggers screen
ja: [ZBX-361] 監視/トリガー画面中にゼロによる割り算が発生する可能性がある問題を修正

source: [ZBX-432] set trigger value to unknown if changed item status
ja: [ZBX-432] アイテムのステータスを変更した際にトリガーの値を不明に設定するように修正

source: [ZBX-2401] fixed host name in dynamic graphs in screens
ja: [ZBX-2401] スクリーンのダイナミックグラフのホスト名を修正

source: [ZBX-1094] fixed calendar position
ja: [ZBX-1094] カレンダーの位置を修正

source: [ZBX-3660] fixed macro resolving in map labels
ja: [ZBX-3660] マップラベルのマクロの展開を修正

source: [ZBX-2787] it is no longer possible add invalid time for IT services, like 1:111 or 23:67 or 4:66 and so on
ja: [ZBX-2787] ITサービスに1:111、23:67、4:66といった無効な時間を追加できないように修正

source: Thanks to Takanori Suzuki.
ja: Takanori Suzukiに感謝

source: [ZBX-908] fixed item nextcheck recalculation on item update
ja: [ZBX-908] アイテム更新時の、アイテムの次回の更新時刻の再計算処理を修正

source: [ZBX-809] fixed memory leak while processing proc.num metric under Win2008
ja: [ZBX-809] Windows 2008でproc.numの処理中に発生していたメモリリークを修正

source: Windows agent's 'service_status[*]' accepts both service name and display name.
ja: Windowsエージェントのservice_status[*]にサービス名と表示名の両方を利用することができます。

source: [ZBXNEXT-396] added optional parameters 'from' and 'to' to zabbix[queue]
ja: [ZBXNEXT-396] zabbix[queue]に「from」と「to」のオプションパラメータを追加

source: [ZBX-2025] fixed deletion of actions
ja: [ZBX-2025] アクションの削除処理を修正

source: [ZBX-95] fixed patch.sql to work with buggy PHPMyAdmin
ja: [ZBX-95] (バギーな)PHPMyAdmin上でもpatch.sqlが動作するように修正

source: Administrators have access only to users they share user groups with.
ja: Zabbix特権管理者は所属するグループに対してのみアクセスできるようになりました。

source: [ZBX-1478] improved php requirements checks
ja: [ZBX-1478] PHPのシステム要件チェックを改善

source: ZABBIX Server
ja: ZABBIXサーバ

source: Passive mode for Proxies
ja: パッシブモードのプロキシ

source: If you are using Zabbix 1.8 with node-based distributed setup, please run the following SQL patch.
ja: Zabbix 1.8でノード構成の分散監視を利用している場合、以下のSQLパッチを実行してください。

source: Host profiles renamed to inventory
ja: ホストプロファイルをインベントリに名称変更

source: [ZBX-19] fixed SMS sending
ja: [ZBX-19] SMSの送信を修正

source: [ZBX-2457] change 'type' keyword to 'ENGINE' for table creation in MySQL schema
ja: [ZBX-2457] テーブル作成のためのMySQLスキーマの「type」キーワードを「ENGINE」へ変更

source: [ZBX-3794] added timeout support to vfs.file.* commands
ja: [ZBX-3794] vfs.file.*コマンドにタイムアウト処理を追加

source: [ZBX-1493] fixed disabled host icon view
ja: [ZBX-1493] 無効の状態のアイコン表示を修正

source: Added support of bar graphs
ja: バーグラフ機能の追加

source: [ZBX-1801] fixed action disable link
ja: [ZBX-1801] アクションの無効のリンクを修正

source: added support network and disk stats under OpenBSD
ja: OpenBSDのネットワークとディスクステータスの監視機能を追加

source: Traceroute and Ping can be executed from the Status of Triggers screen.
ja: トリガーのステータス画面から、TracerouteとPingを実行することができます。

source: [ZBX-1935] remove incorrect item and fix minor typo in the default Windows template
ja: [ZBX-1935] デフォルトのWindowsテンプレートの間違ったアイテムの削除と誤字の修正

source: [ZBX-2347] fixed last 20 issues in event details showing less than 20 issues
ja: [ZBX-2347] イベント詳細画面の最新20件の障害で障害件数が20件以下の場合の表示の問題を修正

source: fixed division by zero in ZABBIX server
ja: ZABBIXサーバのゼロによる割り算を修正

source: [ZBX-1000] enabled zabbix_sender to read its input from stdin; thanks to leo
ja: [ZBX-1000] zabbix_senderが標準入力から入力データを読み込めるように修正; leoに感謝

source: [ZBX-2148] added preview button in graphs form
ja: [ZBX-2148] グラフ設定フォームにプレビューボタンを追加

source: added support of text items for functions str, regexp and iregexp
ja: str、regexp、iregexp関数がテキスト型のアイテムに対応

source: Upgrade
ja: アップグレード

source: fixed sql problem with deletion of many hosts
ja: 複数ホストの削除のSQLの問題を修正

source: A complete text of the license is available at http://www.gnu.org/copyleft/gpl.txt.
ja: ライセンスの詳細については、http://www.gnu.org/copyleft/gpl.txtを参照してください。

source: Old bulkloader has been removed.
ja: 古いbulkloaderは削除されます。

source: [ZBX-337] added Oracle upgrade scripts
ja: [ZBX-337] Oracle用のアップグレードスクリプトを追加

source: [ZBX-1366] fixed dashboard last 20 issues showing events from different triggers
ja: [ZBX-1366] ダッシュボードの「最新20件の障害」で異なるトリガーからイベントが表示される問題を修正

source: [ZBX-1462] fixed "Add host" operation for "Discovery" module for trying to add a host name which is already use
ja: [ZBX-1462] ディスカバリモジュールにおいて、ホスト追加のオペレーションで既に使用しているホスト名を追加しようとした場合の問題を修正

source: Thanks to alixen
ja: alixenに感謝

source: [DEV-265] added popups with links to "Status of trigger" & "Events history" pages
ja: [DEV-265] 「トリガーのステータス」と「イベント履歴」画面にリンクのポップアップを追加

source: [ZBX-301] fixes some typos
ja: [ZBX-301] いくつかのtypoを修正

source: [ZBX-1670] fixed events from slave nodes not shown when all nodes are selected
ja: [ZBX-1670] すべてのノードが選択されていてもスレーブノードからのイベントが表示されない問題を修正

source: [ZBX-3519] fixed unterminated processes when system.run[,wait] times out and added proper output handling for system.run[,nowait] on UNIX
ja: [ZBX-3519] UNIX上のsystem.run[,wait]がタイムアウトした時にプロセスが終了されない問題の修正、およびsystem.run[,nowait]の適切な出力処理を追加

source: New macros
ja: 新しいマクロ

source: ZABBIX Server performance has been improved 3-10 times depending on number and usage of active and passive checks, proxies and congiuration parameters.
ja: 3〜10回の依存関係やアクティブ/パッシブチェックの利用、プロキシ、設定パラメータなどについて、ZABBIXサーバのパフォーマンスを改善しました。

source: Zabbix SIA is proud to announce the availability of Zabbix 1.8.3rc2 (Second Release Candidate).
ja: Zabbix SIAはZABBIX 1.8.3rc2 (2番目のRelease Candidate)のリリースをアナウンスすることを光栄に思います。

source: fixed frontend to accept trigger function time()
ja: トリガー関数time()を許可するようにフロントエンドを修正

source: [ZBX-959] fixed windows agent crash while processing performance counters under Windows 2000.
ja: [ZBX-959] Windows 2000のパフォーマンスカウンタの処理中にWindowsエージェントがクラッシュする問題を修正。

source: Added discovery based on HTTPS and Telnet checks, discovery configuration form is redesigned.
ja: HTTPSとTelnetのチェックによるディスカバリを追加し、ディスカバリ設定フォームを見直しました。

source: Empty passwords are no longer supported and replaced by password "zabbix"
ja: 空パスワードを廃止し、「zabbix」に置き換えられました。

source: [DEV-405] Items, Triggers, Graphs moved under "Configuration->Hosts"
ja: [DEV-405] アイテム、トリガー、グラフを「設定->ホスト」配下に移動

source: The scripts are executed on the single ZABBIX server or any ZABBIX node in the distributed setup.
ja: スクリプトは1つのZABBIXサーバ、または分散環境では複数のZABBIXノードで実行されます。

source: added support of escalations
ja: エスカレーション機能を追加

source: [DEV-46] added "save&return" button in acknowledgements
ja: [DEV-46] 認知機能に「認知 & 戻る」ボタンを追加

source: added support of zabbix[proxy,<proxyname>,lastaccess]
ja: zabbix[proxy,,lastaccess]を追加

source: Support of Oracle will be restored in the next release.
ja: Oracleのサポートは次のリリースで行われる予定です。
